""" 1.
როგორ შევქმნნათ ლისტი (მასივი)? 

a = []
"""

""" 2.
საიდან იწყება მასივის ინდექსების ათვლა?
პასუხი: 0 - დან

"""

""" 3.
ლისტზე (მასივზე) ელემენტზე წვდომა როგორ ხდება? (დაწერეთ მაგალითი, ჩავთვალოთ გვაქვს ცვლადი arr რომელიც ლისტის ტიპისაა)

მაგ: arr[0], arr[1], arr[-2], arr[-1] და ა.შ

"""

""" 4.
რა არის Index Error?

პასუხი: Index Error გვაქვს მაშინ, როდესაც ვცვლიობს მივწვდეთ მასივის ისეთ ელემენტს რომელიც არ არსებობს.
მაგ: arr = [1, 2, 3]
print(arr[3])

"""

""" 5.
როგორ ხდება ლისტში (მასივში), ელემენტების ჩამატება?

arr.append() - ელემენტის მასივის ბოლოში დამატება
.insert(3, 1) - ელემენტის მასივში დამატება (კონკრეტულ ინდექსზე, რა ელემენტი)
.extend - ამატებს მასივში მეორე მასივის ელემენტებს მაგ: numbers1 = [1,2], numbers2 = [3,4]; numbers1.extend(numbers2) => print(numbers1) იქნება: [1, 2, 3, 4]
list concatenation-ით ანუ: arr1 + arr2 იქნება ერთი მასივი ორივე მასივის ელემენტებით

"""

""" 6.
როგორ გავიგოთ ლისტის ზომა?

len(arr)

"""

""" 7.
დაბეჭდეთ თითოეული მასივის ელემენტი ტერმინალში (გამოიყენეთ for ან while ციკლი)

"""
print ("=== FOR ===")
arr = [1, 2, "car", "home"]

for i in arr:
    print (i)
print ("=== WHILE ===")
i = 0
while (i < len(arr)):
  print(arr[i])
  i += 1

""" 8.
დაბეჭდეთ კენტ ინდექსზე მდგომი  მასივის ელემენტები ტერმინალში

"""
print ("=== N 8 (ODD INDEX NUMBERS) ===")
arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

for i in range(1, len(arr), 2):
    print(i, arr[i])

array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print ("=== N 8 (ODD INDEX NUMBERS) OPTION 2===")
for i, element in enumerate(arr):
    if i % 2 != 0:
        print(i, element)
