# რა არის list?
# რა არის ელემენტი?
# როგორ ვწვდებით ლისტის ელემენტებს?

#დაწერეთ კოდი, რომელიც მოცემულ ლისტში ყველა ელემენტს გადაიყვანს მაღალ რეგისტრში (Upper case)

#დაწერეთ კოდი, რომელიც შემნის 1000 ელემენტიან ლისტს, სადაც იქნება მხოლოდ მარტივი რიცხვები (Prime Numbers, რიცხვები, რომლებიც იყოფა მხოლოდ 1-ზე და თავის თავზე)

#რას აკეთებს შემდეგი კოდი?
#აღწერეთ თითეული ხაზი!

#წინა დავალებაში მოცემული ლისტის გამოყენებით, იპოვნეთ პროდუქტი სახელის მიხედვით

#დაწერეთ კოდი, რომელშიც გექნებათ მომხმარებლების სია:
"""
users = [
   ["Legend27", "a1s2d3f4"],
   ["james123", "c5bt43f4"],
   ["DaveIsGreat", "wlervtb3r"]
]
მომხმარებელს ავტორიზაცია გაატარეთ (შემოატანინეთ username და password) თუ ვერ გაიარა ავტორიზაცია quit() ფუნქციით შეაჩერეთ პროგრამა
"""

"""
წინა დავალებებში დაწერილი კოდი (პროდუქტის არჩევაზე და მომხმარებლის ავტორიზაციაზე) გამოიყენეთ და მომხმარებელს პროდუქტი აარჩევინეთ მხოლოდ იმ შემთხვევაში თუ ავტორიზაცია გავლილი აქვს.
"""

"""
users = [
["Legend27", "a1s2d3f4"],
["james123", "c5bt43f4"],
["DaveIsGreat", "wlervtb3r"]
]

balances = [
150000,
12000,
19000
]
ბალანსი ჩაამატეთ შესაბამის ინექსზე users ლისტში (მაგ. განახლებულ ლისტში მეორე ინდექსე მდგომ ელემენტს ასეთი სახე უნდა ჰქონდეს ["james123", "c5bt43f4", 12000])
"""

"""
შეავსეთ ლისტი იმ ასოებით, რომლებიც აკლია პირველიდან ბოლო ელემენტამდე 

alphabet_part = ['c', 'h', 'e']

(ამ შემთხვევაში a-დან h-მდე უნდა შეივსოს მხოლოდ)
უკეთესი იქნება თუ კოდი სხვა ასოებზეც იმუშავებს
"""

#რა არის list slicing? (alphabet[:5]), აღწერეთ მისი მუშაობის პრინციპი